## 실습

In [1]:
import pandas as pd
import numpy as np

In [2]:
data_list = {
    "Name" : ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    "Age" : [25,30,35,40,28],
    "City" : ['New York', 'Los Angeles', 'Chicago', 'Houston', 'San Francisco'],
    "Salary" : [70000, 80000, 120000, 90000, 75000]
}
df = pd.DataFrame(data_list)
df

      Name  Age           City  Salary
0    Alice   25       New York   70000
1      Bob   30    Los Angeles   80000
2  Charlie   35        Chicago  120000
3    David   40        Houston   90000
4      Eve   28  San Francisco   75000

In [3]:
df[['Name','City']]

      Name           City
0    Alice       New York
1      Bob    Los Angeles
2  Charlie        Chicago
3    David        Houston
4      Eve  San Francisco

In [4]:
df[df['Age']>=30]

      Name  Age         City  Salary
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago  120000
3    David   40      Houston   90000

In [5]:
df['Country'] = 'USA'
df

      Name  Age           City  Salary Country
0    Alice   25       New York   70000     USA
1      Bob   30    Los Angeles   80000     USA
2  Charlie   35        Chicago  120000     USA
3    David   40        Houston   90000     USA
4      Eve   28  San Francisco   75000     USA

In [6]:
df.drop(['Salary'],axis=1)

      Name  Age           City Country
0    Alice   25       New York     USA
1      Bob   30    Los Angeles     USA
2  Charlie   35        Chicago     USA
3    David   40        Houston     USA
4      Eve   28  San Francisco     USA

In [7]:
df.drop([3],axis=0)

      Name  Age           City  Salary Country
0    Alice   25       New York   70000     USA
1      Bob   30    Los Angeles   80000     USA
2  Charlie   35        Chicago  120000     USA
4      Eve   28  San Francisco   75000     USA

In [22]:
df.loc[df['Age'] >= 35, 'Salary'] *=1.05
df

      Name  Age           City  Salary Country
0    Alice   25       New York   70000     USA
1      Bob   30    Los Angeles   80000     USA
2  Charlie   35        Chicago  126000     USA
3    David   40        Houston   94500     USA
4      Eve   28  San Francisco   75000     USA

In [26]:
df.loc[df['Name'] == 'Alice', 'City'] = 'Boston'
df

      Name  Age           City  Salary Country
0    Alice   25         Boston   70000     USA
1      Bob   30    Los Angeles   80000     USA
2  Charlie   35        Chicago  126000     USA
3    David   40        Houston   94500     USA
4      Eve   28  San Francisco   75000     USA